In [2]:
import pandas as pd

In [3]:
titanic_data = pd.read_csv("C:\\Users\\M.abdi\\Desktop\\Machine-Learning\\Titanic-Dataset.csv")

In [5]:
titanic_data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [10]:
 pd.read_sql_query

<function pandas.io.sql.read_sql_query(sql, con, index_col: 'str | list[str] | None' = None, coerce_float: 'bool' = True, params: 'list[Any] | Mapping[str, Any] | None' = None, parse_dates: 'list[str] | dict[str, str] | None' = None, chunksize: 'int | None' = None, dtype: 'DtypeArg | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>) -> 'DataFrame | Iterator[DataFrame]'>

In [11]:
titanic_data.shape

(891, 12)

In [13]:
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
type(titanic_data)

pandas.core.frame.DataFrame

In [19]:
titanic_data.tail() #The last 5

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [20]:
titanic_data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [21]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
titanic_data['Survived'][0:5]

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [25]:
titanic_data.Survived[0:5]

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [32]:
titanic_data[['Name','Sex']][10:10]

Empty DataFrame
Columns: [Name, Sex]
Index: []

In [31]:
titanic_data[['Name','Sex','Fare']][10:25]

                                                 Name     Sex     Fare
10                    Sandstrom, Miss. Marguerite Rut  female  16.7000
11                           Bonnell, Miss. Elizabeth  female  26.5500
12                     Saundercock, Mr. William Henry    male   8.0500
13                        Andersson, Mr. Anders Johan    male  31.2750
14               Vestrom, Miss. Hulda Amanda Adolfina  female   7.8542
15                   Hewlett, Mrs. (Mary D Kingcome)   female  16.0000
16                               Rice, Master. Eugene    male  29.1250
17                       Williams, Mr. Charles Eugene    male  13.0000
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  18.0000
19                            Masselmani, Mrs. Fatima  female   7.2250
20                               Fynney, Mr. Joseph J    male  26.0000
21                              Beesley, Mr. Lawrence    male  13.0000
22                        McGowan, Miss. Anna "Annie"  female   8.0292
23                       Sloper, Mr. William Thompson    male  35.5000
24                      Palsson, Miss. Torborg Danira  female  21.0750

In [37]:
titanic_data['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [40]:
titanic_data['Survived'].value_counts(normalize=True) * 100

Survived
0    61.616162
1    38.383838
Name: proportion, dtype: float64

In [46]:
pd.crosstab(titanic_data.Sex, titanic_data.Survived)

Survived    0    1
Sex
female     81  233
male      468  109

In [47]:
pd.crosstab(titanic_data.Sex, titanic_data.Survived, normalize = "index")

Survived         0         1
Sex
female    0.257962  0.742038
male      0.811092  0.188908

In [48]:
pd.crosstab(titanic_data.Sex, titanic_data.Survived, normalize = "columns")

Survived         0         1
Sex
female    0.147541  0.681287
male      0.852459  0.318713

In [50]:
pd.crosstab(titanic_data.Sex, titanic_data.Survived, normalize = "all")

Survived         0         1
Sex
female    0.090909  0.261504
male      0.525253  0.122334

In [59]:
below_5_years = titanic_data[titanic_data.Age<=10]

In [60]:
below_5_years[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q

In [61]:
len(below_5_years)

64